In [2]:
import numpy as np

In [4]:
import pandas as pd

In [6]:
np.random.seed(101)
mydata = np.random.randint(0,101,(4,3))

In [8]:
mydata

array([[95, 11, 81],
       [70, 63, 87],
       [75,  9, 77],
       [40,  4, 63]], dtype=int32)

In [10]:
myindex = ['CA', 'NY', 'AZ', 'TX']

In [12]:
mycolumns = ['Jan', 'Feb', 'Mar']

In [14]:
df = pd.DataFrame(mydata)

In [16]:
df

    0   1   2
0  95  11  81
1  70  63  87
2  75   9  77
3  40   4  63

In [18]:
df = pd.DataFrame(mydata, index=myindex)

In [20]:
df

     0   1   2
CA  95  11  81
NY  70  63  87
AZ  75   9  77
TX  40   4  63

In [22]:
df = pd.DataFrame(mydata, index=myindex, columns=mycolumns)

In [24]:
df

    Jan  Feb  Mar
CA   95   11   81
NY   70   63   87
AZ   75    9   77
TX   40    4   63

In [27]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, CA to TX
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Jan     4 non-null      int32
 1   Feb     4 non-null      int32
 2   Mar     4 non-null      int32
dtypes: int32(3)
memory usage: 80.0+ bytes

In [28]:
# Where is my python code located?

In [30]:
pwd

'e:\\Codes\\MachineLearning'

In [32]:
ls

 Volume in drive E is New Volume
 Volume Serial Number is CC40-7AB2

 Directory of e:\Codes\MachineLearning

07/22/2024  12:38 PM    <DIR>          .
07/09/2024  11:35 AM    <DIR>          ..
07/22/2024  12:50 PM             8,660 datafram.ipynb
07/22/2024  12:23 PM           740,146 series.ipynb
07/22/2024  12:37 PM             6,428 series2.ipynb
               3 File(s)        755,234 bytes
               2 Dir(s)  18,126,348,288 bytes free

In [37]:
df = pd.read_csv('tips.csv')

In [39]:
df

   junayed   hridoy   samiul   himel   sohan   rabby
0       22       22       22      22      22      22
1      215      215      264    1648    6321    6458